/*
 messages.strings
 EziSocialTestProject
 
 Created by Paras Mendiratta on 16/07/14.
 Copyright (c) 2014 EziByte Technologies. All rights reserved.
 */


/*
 **
 ** List of Error Messages
 ** ----------------------
 */

// Titles
"BAD_REQUEST" = "BAD Request";
"OK_REQUEST"  = "Request Successful";

// General Messages
"100" = "Internet Unavailable";
"101" = "Cannot connect with server";
"102" = "Bad Request! Invalid Parameters";

// Player - Messages
"200" = "Player registration successful";
"201" = "Player login successful";
"202" = "Player account details merged successfully";

"210" = "Player record not found";


// Game - Messages
"310" = "Invalid game key mate! Please make sure key is same as displayed in EziSocial dashboard.";
"311" = "Invalid secret key! Please make sure key is same as displayed in EziSocial dashboard.";
"312" = "Game deactivate! To use this game key again, please activate product from EziSocial dashboard.";
"313" = "Invalid Platform! This game is not available for iOS Platform. Please add/activate iOS platform from dashboard.";
"314" = "Invalid bundle identifier! iOS bundle identifier does not match with identifier stored on the server.";
"315" = "iOS Platform is suspended on server. Please activate iOS platform from app details page.";

